rails-workspace/Blogsite/app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Title"], ["content", "contentdsds"], ["created_at", "2021-11-17 19:47:36.986129"], ["updated_at", "2021-11-17 19:47:36.986129"]]
---
  def create
    @blog = Blog.create(blog_params)

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "content" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["content", "fdfsdfsdds"], ["updated_at", "2021-11-17 19:52:44.155060"], ["id", 1]]
---
  def update
    @blog =  Blog.find(params[:id])

    if @blog.update(blog_params)